#language: ru
Функционал: Сбребанк кредитование

  Сценарий: Покупка квартиры в новостройке


    Когда Выбрали меню
    Когда Выбрали подменю -  "Приобретение готового жилья"
    Тогда Нажали кнопку рассчитать
    Тогда Проверили заголовок страницы -  "Онлайн консультация и одобрение ипотеки без визита в офис банка"
    Тогда Выбрали цель кредита -  "Покупка квартиры в новостройке"
    Тогда Установили стоимость недвижимости -  "6 000 000 ₽"
    Тогда Установили первоначальный взнос -  "3 000 000 ₽"
    Тогда Установили срок -  "10 лет"
    Тогда Установили чекбоксы
    Тогда Проверили сумму кредита -  "3 000 000 ₽"
    Тогда Проверили ежемесячный платеж -  "40 313 ₽"
    Тогда Проверили ставку кредита -  "10,4 %"
    Тогда Проверили необходимый доход -  "57 590 ₽"

    